// Импортируем библиотеку VUE
import { createApp } from "vue";

// Импортируем приложение APP из файла ./App.vue
import App from "./App.vue";

// Импортируем маршруты из всей папки ./router
import router from "./router";

// Вызываем функцию "СоздатьПриложение" и передаем значение объекта App созданного через вызов import
// "Использовать" маршрут из объекта router созданного через вызов import
// "Монтировать / Устанавливать" связь с селектором / идентификатором в файле public/index.html id="app"
// Все полученные данные или созданные в этих файлах будут отрисовываться или отображаться в селекторе app index.html
createApp(App).use(router).mount("#app");
